In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users = {
    'User ID': [1,2,3,4,5],
    'Username': ['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age': [18,35,25,38,45],
    'Joined Date': ['2032-01-01', '2032-02-15','2032-04-25','2032-06-21','2032-09-15'],
    'Total Posts': [150,230,80,420,310],
    'Reputation': [500, 720,200,940,500]
}


df = pd.DataFrame(forum_users)
df

   User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2032-01-01          150         500
1        2   jane_smith   35  2032-02-15          230         720
2        3      alex123   25  2032-04-25           80         200
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         500

In [5]:
df[['Username', 'Age']]

      Username  Age
0     bogdan_s   18
1   jane_smith   35
2      alex123   25
3        bob56   38
4  mark_wilson   45

In [8]:
df.loc[3]

User ID                 4
Username            bob56
Age                    38
Joined Date    2032-06-21
Total Posts           420
Reputation            940
Name: 3, dtype: object

In [9]:
df.loc[2:3]

   User ID Username  Age Joined Date  Total Posts  Reputation
2        3  alex123   25  2032-04-25           80         200
3        4    bob56   38  2032-06-21          420         940

In [11]:
df.loc[2:3, ['Username', 'Joined Date', 'Reputation']]

  Username Joined Date  Reputation
2  alex123  2032-04-25         200
3    bob56  2032-06-21         940

In [12]:
df.iloc[3]

User ID                 4
Username            bob56
Age                    38
Joined Date    2032-06-21
Total Posts           420
Reputation            940
Name: 3, dtype: object

In [13]:
df.iloc[2:4]

   User ID Username  Age Joined Date  Total Posts  Reputation
2        3  alex123   25  2032-04-25           80         200
3        4    bob56   38  2032-06-21          420         940

In [15]:
df.iloc[2:4, 1:4]

  Username  Age Joined Date
2  alex123   25  2032-04-25
3    bob56   38  2032-06-21

In [19]:
df[df['Age'] >= 25]

   User ID     Username  Age Joined Date  Total Posts  Reputation
1        2   jane_smith   35  2032-02-15          230         720
2        3      alex123   25  2032-04-25           80         200
3        4        bob56   38  2032-06-21          420         940
4        5  mark_wilson   45  2032-09-15          310         500